Revit 2027 API
FabricationPart.GetSeamInfo Method
 Gets the seam information for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSeamInfo(
	int seamIndex,
	out bool locked
)
Public Function GetSeamInfo (
	seamIndex As Integer,
	<OutAttribute> ByRef locked As Boolean
) As Integer
public:
int GetSeamInfo(
	int seamIndex,
	[OutAttribute] bool% locked
)
member GetSeamInfo :
        seamIndex : int *
        locked : bool byref -> int
Parameters
seamIndex Int32
 The index of the seam to get.
locked Boolean
 The locked status to be returned.
Return Value
Int32
 Returns the database identifier of the seam.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The seam index is out of valid range.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace